[
  {
    "title": "Breaking Bad",
    "overview": "Walter White, a New Mexico chemistry teacher, is diagnosed with Stage III cancer and given a prognosis of only two years left to live. He becomes filled with a sense of fearlessness and an unrelenting desire to secure his family's financial future at any cost as he enters the dangerous world of drugs and crime.",
    "cast": [
      "Walter White",
      "Jesse Pinkman",
      "Hank Schrader",
      "Marie Schrader",
      "Skyler White",
      "Walter White Jr.",
      "Saul Goodman",
      "Mike Ehrmantraut",
      "Steven Gomez"
    ],
    "url": "https://www.themoviedb.org/tv/1396-breaking-bad"
  },
  {
    "title": "Hazbin Hotel",
    "overview": "In attempt to find a non-violent alternative for reducing Hell's overpopulation, the daughter of Lucifer opens a rehabilitation hotel that offers a group of misfit demons a chance at redemption.",
    "cast": [
      "Charlie Morningstar",
      "Vaggie",
      "Angel Dust",
      "Alastor",
      "Husk",
      "Niffty",
      "Sir Pentious",
      "Valentino",
      "Lute"
    ],
    "url": "https://www.themoviedb.org/tv/94954-hazbin-hotel"
  },
  {
    "title": "Frieren: Beyond Journey's End",
    "overview": "After the party of heroes defeated the Demon King, they restored peace to the land and returned to lives of solitude. Generations pass, and the elven mage Frieren comes face to face with humanity’s mortality. She takes on a new apprentice and promises to fulfill old friends’ dying wishes. Can an elven mind make peace with the nature of life and death? Frieren embarks on her quest to find out.",
    "cast": [
      "Frieren",
      "Himmel",
      "Heiter",
      "Eisen",
      "Fern",
      "Stark",
      "Lawine",
      "Denken"
    ],
    "url": "https://www.themoviedb.org/tv/209867"
  },
  {
    "title": "Arcane",
    "overview": "Amid the stark discord of twin cities Piltover and Zaun, two sisters fight on rival sides of a war between magic technologies and clashing convictions.",
    "cast": [
      "Vi",
      "Jinx",
      "Silco",
      "Jayce",
      "Mel Medarda",
      "Viktor",
      "Marcus",
      "Sevika",
      "Vander"
    ],
    "url": "https://www.themoviedb.org/tv/94605-arcane"
  },
  {
    "title": "Avatar: The Last Airbender",
    "overview": "In a war-torn world of elemental magic, a young boy reawakens to undertake a dangerous mystic quest to fulfill his destiny as the Avatar, and bring peace to the world.",
    "cast": [
      "Aang",
      "Katara",
      "Sokka",
      "Zuko",
      "Toph Beifong",
      "Iroh",
      "Azula",
      "Ty Lee"
    ],
    "url": "https://www.themoviedb.org/tv/246-avatar-the-last-airbender"
  },
  {
    "title": "One Piece",
    "overview": "Years ago, the fearsome Pirate King, Gol D. Roger was executed leaving a huge pile of treasure and the famous \"One Piece\" behind. Whoever claims the \"One Piece\" will be named the new King of the Pirates.",
    "cast": [
      "Roronoa Zoro",
      "Nami",
      "Monkey D. Luffy",
      "Usopp",
      "Sanji",
      "Tony Tony Chopper",
      "Johan",
      "Franky",
      "Brook"
    ],
    "url": "https://www.themoviedb.org/tv/37854"
  },
  {
    "title": "Fullmetal Alchemist: Brotherhood",
    "overview": "Disregard for alchemy’s laws ripped half of Edward Elric’s limbs from his body and left his brother Alphonse’s soul clinging to a suit of armor. To restore what was lost, the brothers seek the Philosopher’s Stone. Enemies and allies – the corrupt military, the Homunculi, and foreign alchemists – will alter the Elric brothers course, but their purpose will remain unchanged and their bond unbreakable.",
    "cast": [
      "Alphonse Elric",
      "Edward Elric",
      "Roy Mustang",
      "Riza Hawkeye",
      "Winry Rockbell",
      "Narrator",
      "Scar",
      "May Chang"
    ],
    "url": "https://www.themoviedb.org/tv/31911-fullmetal-alchemist"
  },
  {
    "title": "Rick and Morty",
    "overview": "Rick is a mentally-unbalanced but scientifically gifted old man who has recently reconnected with his family. He spends most of his time involving his young grandson Morty in dangerous, outlandish adventures throughout space and alternate universes. Compounded with Morty's already unstable family life, these events cause Morty much distress at home and school.",
    "cast": [
      "Rick Sanchez / Morty Smith",
      "Summer Smith",
      "Jerry Smith",
      "Beth Smith",
      "Jessica",
      "Birdperson",
      "Mr. Nimbus",
      "Phoenixperson",
      "King of the Sun",
      "Roy's Teacher / Gromflamite Fed",
      "Rabbi"
    ],
    "url": "https://www.themoviedb.org/tv/60625-rick-and-morty"
  },
  {
    "title": "Better Call Saul",
    "overview": "Six years before Saul Goodman meets Walter White. We meet him when the man who will become Saul Goodman is known as Jimmy McGill, a small-time lawyer searching for his destiny, and, more immediately, hustling to make ends meet. Working alongside, and, often, against Jimmy, is “fixer” Mike Ehrmantraut. The series tracks Jimmy’s transformation into Saul Goodman, the man who puts “criminal” in “criminal lawyer\".",
    "cast": [
      "Jimmy McGill",
      "Mike Ehrmantraut",
      "Kim Wexler",
      "Lalo Salamanca",
      "Gus Fring",
      "Howard Hamlin",
      "Nacho Varga",
      "Chuck McGill",
      "Hector Salamanca"
    ],
    "url": "https://www.themoviedb.org/tv/60059-better-call-saul"
  },
  {
    "title": "Chernobyl",
    "overview": "The true story of one of the worst man-made catastrophes in history: the catastrophic nuclear accident at Chernobyl. A tale of the brave men and women who sacrificed to save Europe from unimaginable disaster.",
    "cast": [
      "Valery Legasov",
      "Boris Shcherbina",
      "Ulana Khomyuk",
      "Anatoly Dyatlov",
      "Lyudmilla Ignatenko",
      "Vasily Ignatenko",
      "Alexandr Akimov",
      "Leonid Toptunov",
      "Viktor Bryukhanov"
    ],
    "url": "https://www.themoviedb.org/tv/87108-chernobyl"
  },
  {
    "title": "Anne with an E",
    "overview": "A coming-of-age story about an outsider who, against all odds and numerous challenges, fights for love and acceptance and for her place in the world. The series centers on a young orphaned girl in the late 1890’s, who, after an abusive childhood spent in orphanages and the homes of strangers, is mistakenly sent to live with an elderly woman and her aging brother. Over time, 13-year-old Anne will transform their lives and eventually the small town in which they live with her unique spirit, fierce intellect and brilliant imagination.",
    "cast": [
      "Anne Shirley",
      "Marilla Cuthbert",
      "Matthew Cuthbert",
      "Diana Barry",
      "Gilbert Blythe",
      "Rachel Lynde",
      "Mrs. Eliza Barry",
      "Jerry Baynard",
      "Ruby Gillis"
    ],
    "url": "https://www.themoviedb.org/tv/70785-anne-with-an-e"
  },
  {
    "title": "Marry My Husband",
    "overview": "Kang Ji-won, a terminally ill cancer patient, is killed by her husband and best friend after she witnesses them having an affair. She wakes up 10 years before the incident and decides to seek revenge with the help of Yu Ji-hyuk, a director at the company where she works. Now, she must reclaim her fate and eliminate the trash from her life.",
    "cast": [
      "Kang Ji-won",
      "Yoo Ji-hyeok",
      "Park Min-hwan",
      "Jeong Su-min",
      "Baek Eun-ho",
      "Yang Joo-ran",
      "Oh Yu-ra",
      "Yoo Hee-yeon",
      "Kim Kyung-wook"
    ],
    "url": "https://www.themoviedb.org/tv/221851"
  },
  {
    "title": "The Owl House",
    "overview": "An animated fantasy-comedy series that follows Luz, a self-assured teenage girl who accidentally stumbles upon a portal to a magical world where she befriends a rebellious witch, Eda, and an adorably tiny warrior, King. Despite not having magical abilities, Luz pursues her dream of becoming a witch by serving as Eda's apprentice at the Owl House and ultimately finds a new family in an unlikely setting.",
    "cast": [
      "Luz Noceda",
      "Eda Clawthorne",
      "Lilith",
      "Amity",
      "Boscha",
      "Roselle",
      "Principal Bump"
    ],
    "url": "https://www.themoviedb.org/tv/92685-the-owl-house"
  },
  {
    "title": "Alchemy of Souls",
    "overview": "A powerful sorceress in a blind woman's body encounters a man from a prestigious family, who wants her help to change his destiny.",
    "cast": [
      "Jang Uk",
      "Naksu",
      "Seo Yul",
      "Crown Prince Go Won",
      "Park Jin",
      "Maid Kim Do-ju",
      "Park Dang-gu",
      "Jin Cho-yeon",
      "Jin Mu"
    ],
    "url": "https://www.themoviedb.org/tv/135157"
  },
  {
    "title": "Attack on Titan",
    "overview": "Many years ago, the last remnants of humanity were forced to retreat behind the towering walls of a fortified city to escape the massive, man-eating Titans that roamed the land outside their fortress. Only the heroic members of the Scouting Legion dared to stray beyond the safety of the walls – but even those brave warriors seldom returned alive. Those within the city clung to the illusion of a peaceful existence until the day that dream was shattered, and their slim chance at survival was reduced to one horrifying choice: kill – or be devoured!",
    "cast": [
      "Eren Yeager",
      "Mikasa Ackerman",
      "Armin Arlert",
      "Jean Kirstein",
      "Connie Springer",
      "Reiner Braun",
      "Sasha Blouse",
      "Hange Zoë",
      "Zeke, The Beast Titan"
    ],
    "url": "https://www.themoviedb.org/tv/1429"
  },
  {
    "title": "Demon Slayer: Kimetsu no Yaiba",
    "overview": "It is the Taisho Period in Japan. Tanjiro, a kindhearted boy who sells charcoal for a living, finds his family slaughtered by a demon. To make matters worse, his younger sister Nezuko, the sole survivor, has been transformed into a demon herself. Though devastated by this grim reality, Tanjiro resolves to become a “demon slayer” so that he can turn his sister back into a human, and kill the demon that massacred his family.",
    "cast": [
      "Tanjiro Kamado",
      "Nezuko Kamado",
      "Zenitsu Agatsuma",
      "Inosuke Hashibira",
      "Kakushi",
      "Giyu Tomioka",
      "Genya Shinazugawa",
      "Tengen Uzui",
      "Muichiro Tokito"
    ],
    "url": "https://www.themoviedb.org/tv/85937"
  },
  {
    "title": "Fighting Spirit",
    "overview": "Makunouchi Ippo is an ordinary high school student in Japan. Since he spends most of his time away from school helping his mother run the family business, he doesn't get to enjoy his younger years like most teenagers. Always a target for bullying at school (the family fishing business grants him a distinct odor), Ippo's life is one of hardship. One of these after-school bullying sessions turns Ippo's life around for the better, as he is saved by a boxer named Takamura. He decides to follow in Takamura's footsteps and train to become a boxer, giving his life direction and purpose. Ippo's path to perfecting his pugilistic prowess is just beginning...",
    "cast": [
      "Ippo Makunouchi",
      "Mamoru Takamura",
      "Masaru Aoki",
      "Tatsuya Kimura",
      "Ichiro Miyata",
      "Kumi Mashiba",
      "Genji Kamogawa",
      "Haruhiko Yagi",
      "Takeshi Sendo"
    ],
    "url": "https://www.themoviedb.org/tv/42705"
  },
  {
    "title": "The Sopranos",
    "overview": "The story of New Jersey-based Italian-American mobster Tony Soprano and the difficulties he faces as he tries to balance the conflicting requirements of his home life and the criminal organization he heads. Those difficulties are often highlighted through his ongoing professional relationship with psychiatrist Jennifer Melfi. The show features Tony's family members and Mafia associates in prominent roles and story arcs, most notably his wife Carmela and his cousin and protégé Christopher Moltisanti.",
    "cast": [
      "Tony Soprano",
      "Carmela Soprano",
      "Meadow Soprano",
      "A.J. Soprano",
      "Jennifer Melfi",
      "Christopher Moltisanti",
      "Silvio Dante",
      "Paulie Gualtieri",
      "Corrado 'Junior' Soprano"
    ],
    "url": "https://www.themoviedb.org/tv/1398-the-sopranos"
  },
  {
    "title": "INVINCIBLE",
    "overview": "Mark Grayson is a normal teenager except for the fact that his father is the most powerful superhero on the planet. Shortly after his seventeenth birthday, Mark begins to develop powers of his own and enters into his father’s tutelage.",
    "cast": [
      "Mark Grayson",
      "Debbie Grayson",
      "Nolan Grayson",
      "Cecil",
      "Amber",
      "Eve",
      "William",
      "Rex"
    ],
    "url": "https://www.themoviedb.org/tv/95557-invincible"
  },
  {
    "title": "My Hero Academia",
    "overview": "A superhero-admiring boy without any powers enrolls in a prestigious hero academy and learns what it really means to be a hero.",
    "cast": [
      "Izuku Midoriya",
      "Katsuki Bakugo",
      "Shoto Todoroki",
      "All Might",
      "Ochako Uraraka",
      "Tenya Iida",
      "Tsuyu Asui",
      "Shota Aizawa",
      "Tomura Shigaraki"
    ],
    "url": "https://www.themoviedb.org/tv/65930"
  },
  {
    "title": "Kamisama Kiss",
    "overview": "Nanami was just a normal high school girl down on her luck until a stranger’s lips marked her as the new Land God and turned her world upside down. Now, she’s figuring out the duties of a deity with the help of Tomoe, a reformed fox demon who reluctantly becomes her familiar in a contract sealed with a kiss. The new responsibilities—and boys—are a lot to handle, like the crow demon masquerading as a gorgeous pop idol and the adorable snake spirit who’s chosen the newly minted god to be his bride. As the headstrong Tomoe tries to whip her into shape, Nanami finds that love just might have cute, pointed fox ears. With romance in the air, will the human deity be able to prove herself worthy of her new title?",
    "cast": [
      "Numa no Himemiko",
      "Nanami Momozono",
      "Sukuna Ryuuou",
      "Kurama",
      "Ami Nekota",
      "Narrator",
      "Isohime",
      "Isobe",
      "Mikage"
    ],
    "url": "https://www.themoviedb.org/tv/62741"
  },
  {
    "title": "Slam Dunk",
    "overview": "Sakuragi Hanamichi is a junior high punk used to getting into fights and being rejected by girls but upon entering high school he meets the girl of his dreams, Haruko Akagi. He will do anything in order to win her heart including joining the school basketball team that is aiming to conquer the nation lead by Haruko's brother. The problem is that Sakuragi has never played basketball before and a freshman sensation is stealing the spotlight and Haruko's affection from him.",
    "cast": [
      "Hanamichi Sakuragi",
      "Kaede Rukawa",
      "Takenori Akagi",
      "Ryota Miyagi",
      "Hisashi Mitsui",
      "Haruko Akagi",
      "Ayako",
      "Kiminobu Kogure",
      "Shin'ichi Maki"
    ],
    "url": "https://www.themoviedb.org/tv/42573"
  },
  {
    "title": "Death Note",
    "overview": "Light Yagami is an ace student with great prospects—and he’s bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and Light has vowed to use the power of the Death Note to rid the world of evil. But will Light succeed in his noble goal, or will the Death Note turn him into the very thing he fights against?",
    "cast": [
      "Light Yagami",
      "Ryuk",
      "Misa Amane",
      "Rem",
      "Soichiro Yagami",
      "Touta Matsuda",
      "Shuichi Aizawa",
      "Kanzo Mogi"
    ],
    "url": "https://www.themoviedb.org/tv/13916-death-note"
  },
  {
    "title": "Goblin",
    "overview": "In his quest for a bride to break his immortal curse, a 939-year-old guardian of souls meets a grim reaper and a sprightly student with a tragic past.",
    "cast": [
      "Kim Shin",
      "Ji Eun-tak",
      "Grim Reaper",
      "Yoo Deok-hwa",
      "Sam-shin",
      "Yoo Shin-woo",
      "Park Joong-heon"
    ],
    "url": "https://www.themoviedb.org/tv/67915"
  },
  {
    "title": "Weightlifting Fairy Kim Bok-joo",
    "overview": "A competitive swimmer crosses paths with his childhood friend, a rising weight lifting star, and realizes that she has a secret crush on his cousin.",
    "cast": [
      "Kim Bok-joo",
      "Jung Joon-hyung",
      "Song Shi-ho",
      "Jung Jae-yi",
      "Jung Nan-hee",
      "Bang Woon-ki",
      "Tae-kwon",
      "Soo-bin",
      "Lee Sun-ok"
    ],
    "url": "https://www.themoviedb.org/tv/68349"
  },
  {
    "title": "Regular Show",
    "overview": "Two bored groundskeepers, Mordecai (a six-foot-tall blue jay) and Rigby (a hyperactive raccoon) are best friends who spend their days trying to entertain themselves by any means necessary, much to the displeasure of their boss. Their everyday pursuits often lead to things spiraling out of control and into the surreal.",
    "cast": [
      "Mordecai",
      "Rigby",
      "Skips",
      "Benson",
      "Margaret",
      "Starla"
    ],
    "url": "https://www.themoviedb.org/tv/31132-regular-show"
  },
  {
    "title": "Toilet-Bound Hanako-kun",
    "overview": "First year high school student and occultist, Nene Yashiro summons \"Hanako-san of the Toilet\" to grant her romantic wishes. She ends up Hanako's spiritual assistant, helping him destroy supernatural beings and change rumors to balance the spirit and human worlds. Along the way, Nene learns about her connection to the spirit world and the dark secrets regarding Hanako's past.",
    "cast": [
      "Hanako-kun",
      "Nene Yashiro",
      "Kou Minamoto",
      "Aoi Akane",
      "Teru Minamoto",
      "Sakura",
      "Natsushiko Hyūga",
      "Lemon Yamabuki",
      "Tsuchigomori"
    ],
    "url": "https://www.themoviedb.org/tv/95269"
  },
  {
    "title": "Primal",
    "overview": "A caveman forms a bond with a dinosaur as they struggle to survive in a hostile world.",
    "cast": [
      "Spear",
      "Mira",
      "Shelton",
      "Krog",
      "Charles",
      "Blakely",
      "Lord Darlington"
    ],
    "url": "https://www.themoviedb.org/tv/89456-primal"
  },
  {
    "title": "X-Men '97",
    "overview": "The X-Men, a band of mutants who use their uncanny gifts to protect a world that hates and fears them, are challenged like never before, forced to face a dangerous and unexpected new future.",
    "cast": [
      "Jubilee",
      "Beast",
      "Cyclops",
      "Storm",
      "Jean Grey",
      "Wolverine",
      "Rogue",
      "Morph",
      "Magneto"
    ],
    "url": "https://www.themoviedb.org/tv/138502-x-men-97"
  },
  {
    "title": "Once",
    "overview": "The series revolves around Gabo, a soccer-loving teenager who, upon receiving a scholarship from the prestigious Sports Academic Institute (IAD) of Buenos Aires, will see his dream of playing at Los Halcones Dorados, the renowned amateur team of the school, and also his longing to become a professional footballer.",
    "cast": [
      "Gabriel \"Gabo\" Moretti",
      "Lorenzo Guevara",
      "Ricardo \"Ricky\" Flores",
      "André \"Dedé\" Duarte",
      "Zoe Velázquez",
      "Joaquín Costa",
      "Apolodoros \"Catorce\" Nikotatópulos",
      "Adrián Roca",
      "Pablo Espiga"
    ],
    "url": "https://www.themoviedb.org/tv/72637-o11ce"
  },
  {
    "title": "Merlí",
    "overview": "He’s surly, unorthodox, unapologetically blunt, and he’s about to change your life. Meet the new philosophy teacher, Merlí, who will help his students view the world in a whole new light, both in and out of the classroom.",
    "cast": [
      "Merlí Bergeron Calduch",
      "Pol Rubio",
      "Bruno Bergeron",
      "Tània Illa",
      "Marc Vilaseca",
      "Gerard Piguillem Castells",
      "Mònica de Villamore",
      "Joan Capdevila Bonet",
      "Berta Prats García"
    ],
    "url": "https://www.themoviedb.org/tv/62914-merli"
  },
  {
    "title": "Haikyu!!",
    "overview": "Inspired by a small-statured pro volleyball player, Shouyou Hinata creates a volleyball team in his last year of middle school. Unfortunately the team is matched up against the \"King of the Court\" Tobio Kageyama's team in their first tournament and inevitably lose. After the crushing defeat, Hinata vows to surpass Kageyama. After entering high school, Hinata joins the volleyball team only to find that Tobio has also joined.",
    "cast": [
      "Shoyo Hinata",
      "Tobio Kageyama",
      "Ryunosuke Tanaka",
      "Daichi Sawamura",
      "Koshi Sugawara",
      "Kei Tsukishima",
      "Tadashi Yamaguchi",
      "Yu Nishinoya",
      "Asahi Azumane"
    ],
    "url": "https://www.themoviedb.org/tv/60863"
  },
  {
    "title": "Hunter x Hunter",
    "overview": "Twelve-year-old Gon Freecss one day discovers that the father he had always been told was dead was alive. His Father, Ging, is a Hunter — a member of society's elite with a license to go anywhere or do almost anything. Gon, determined to follow in his father's footsteps, decides to take the Hunter Examination and eventually find his father to prove himself as a Hunter in his own right. But on the way, he learns that there is more to becoming a Hunter than previously thought, and the challenges that he must face are considered the toughest in the world.",
    "cast": [
      "Gon",
      "Killua",
      "Narrator",
      "Kurapika",
      "Leorio",
      "Hisoka"
    ],
    "url": "https://www.themoviedb.org/tv/46298-hunterxhunter"
  },
  {
    "title": "I Am Not an Animal",
    "overview": "I Am Not An Animal is an animated comedy series about the only six talking animals in the world, whose cosseted existence in a vivisection unit is turned upside down when they are liberated by animal rights activists.",
    "cast": [
      "Mark the Bird",
      "Claire the Rat",
      "Kieron the Cat",
      "Hugh the Monkey",
      "Winona the Dog",
      "Narrator",
      "Niall the Rabbit"
    ],
    "url": "https://www.themoviedb.org/tv/100-i-am-not-an-animal"
  },
  {
    "title": "Heartstopper",
    "overview": "Teens Charlie and Nick discover their unlikely friendship might be something more as they navigate school and young love in this coming-of-age series.",
    "cast": [
      "Charlie Spring",
      "Nick Nelson",
      "Tao Xu",
      "Elle Argent",
      "Isaac Henderson",
      "Imogen Heaney",
      "Tara Jones",
      "Darcy Olsson",
      "Tori Spring"
    ],
    "url": "https://www.themoviedb.org/tv/124834-heartstopper"
  },
  {
    "title": "Bluey",
    "overview": "Bluey is an inexhaustible six year-old Blue Heeler dog, who loves to play and turns everyday family life into extraordinary adventures, developing her imagination as well as her mental, physical and emotional resilience.",
    "cast": [
      "Bandit Heeler",
      "Chilli Heeler",
      "Pat",
      "Uncle Stripe",
      "Aunt Trixie",
      "Mackenzie",
      "Calypso",
      "Snickers"
    ],
    "url": "https://www.themoviedb.org/tv/82728-bluey"
  },
  {
    "title": "Love, Victor",
    "overview": "Victor is a new student at Creekwood High School on his own journey of self-discovery, facing challenges at home, adjusting to a new city, and struggling with his sexual orientation. When it all seems too much, he reaches out to Simon to help him navigate the ups and downs of high school.",
    "cast": [
      "Victor Salazar",
      "Mia Brooks",
      "Felix Weston",
      "Lake Meriwether",
      "Andrew Spencer",
      "Benjamin 'Benji' Campbell",
      "Pilar Salazar",
      "Adrian Salazar",
      "Armando Salazar"
    ],
    "url": "https://www.themoviedb.org/tv/97186-love-victor"
  },
  {
    "title": "Ranma ½",
    "overview": "Ranma Saotome, a teenage martial artist, and his father Genma travel to the 'cursed training ground' of Jusenkyo in China. There, despite the warnings of the Chinese guard, they fall into the cursed springs. From now on, whenever Ranma is doused in cold water, he turns into a girl and a cute, well-built redhead at that. Hot water changes him back into a man again, but only until the next time. To make matters worse, his father engages him to Akane Tendo, a girl who hates boys.",
    "cast": [
      "Ranma Saotome ♂",
      "Ranma Saotome ♀",
      "Akane Tendo",
      "Genma Saotome",
      "Kasumi Tendo",
      "Nabiki Tendo",
      "Soun Tendo",
      "Narrator",
      "Ryoga Hibiki"
    ],
    "url": "https://www.themoviedb.org/tv/57706"
  },
  {
    "title": "The Originals",
    "overview": "A spin-off from The Vampire Diaries and set in New Orleans, The Originals centers on the Mikaelson siblings, otherwise known as the world's original vampires: Klaus, Elijah, and Rebekah. Now Klaus must take down his protégé, Marcel, who is now in charge of New Orleans, in order to re-take his city, as he originally built New Orleans. Klaus departed from the city after being chased down by his father Mikael, while it was being constructed and Marcel took charge. As Klaus has returned after many years, his ego has provoked him to become the king of the city. \"Every King needs an heir\" says Klaus, accepting the unborn child. The child is a first to be born to a hybrid and a werewolf.",
    "cast": [
      "Klaus Mikaelson",
      "Elijah Mikaelson",
      "Marcel Gerard",
      "Hayley Marshall",
      "Davina Claire",
      "Camille O'Connell",
      "Freya Mikaelson",
      "Vincent Griffith, Vincent",
      "Rebekah Mikaelson"
    ],
    "url": "https://www.themoviedb.org/tv/46896-the-originals"
  },
  {
    "title": "Kaiju No. 8",
    "overview": "In a world plagued by creatures known as Kaiju, Kafka Hibino aspired to enlist in The Defense Force. He makes a promise to enlist with his childhood friend, Mina Ashiro. Soon, life takes them in separate ways. While employed cleaning up after Kaiju battles, Kafka meets Reno Ichikawa. Reno's determination to join The Defense Force reawakens Kafka's promise to join Mina and protect humanity.",
    "cast": [
      "Kafka Hibino",
      "Mina Ashiro",
      "Reno Ichikawa",
      "Kikoru Shinomiya",
      "Soshiro Hoshina",
      "Haruichi Izumo",
      "Aoi Kaguragi",
      "Iharu Furuhashi",
      "Konomi Okonogi"
    ],
    "url": "https://www.themoviedb.org/tv/207468"
  },
  {
    "title": "Stranger Things",
    "overview": "When a young boy vanishes, a small town uncovers a mystery involving secret experiments, terrifying supernatural forces, and one strange little girl.",
    "cast": [
      "Jane 'Eleven' Hopper",
      "Mike Wheeler",
      "Dustin Henderson",
      "Lucas Sinclair",
      "Steve Harrington",
      "Joyce Byers",
      "Jim Hopper",
      "Nancy Wheeler",
      "Jonathan Byers"
    ],
    "url": "https://www.themoviedb.org/tv/66732-stranger-things"
  },
  {
    "title": "Zoids: Chaotic Century",
    "overview": "Van discovers a Zoid Organoid in an abandoned laboratory while running from two strangers piloting Zoids. Also in the laboratory, in an animated suspension tube is a strange girl. He breaks the tube open and takes her and the Organoid with him. The girl, who says her name is Fiona, wants to find something called \"Zoids Eve\", and so Van, the Organoid Zeke, and Fiona begin their adventure.",
    "cast": [
      "Van Flyheight",
      "Fiona Elisi Linette",
      "Raven",
      "Zeke",
      "Louise Theresa Camford",
      "Gunther Prozen",
      "Kruger",
      "Irvine",
      "Moonbay"
    ],
    "url": "https://www.themoviedb.org/tv/37419"
  },
  {
    "title": "Desafío Champions Sendokai",
    "overview": "We don't have an overview translated in English. Help us expand our database by adding one.",
    "cast": [
      "Animación",
      "Acción"
    ],
    "url": "https://www.themoviedb.org/tv/80040-desafio-champions-sendokai"
  },
  {
    "title": "Big Time Rush",
    "overview": "Four teenage friends move from Minneapolis to Los Angeles to form a potential chart-topping boy band after Kendall is inadvertently discovered by an eccentric record executive, Gustavo Rocque. As they seize this opportunity of a lifetime, these friends embark on an exciting comedy and music-filled journey to prove to themselves and their record label that they are serious about their new career choice.",
    "cast": [
      "Kendall Knight",
      "Logan Mitchell",
      "James Diamond",
      "Carlos Garcia",
      "Gustavo Rocque",
      "Katie Knight",
      "Kelly Wainwright",
      "Jennifer Knight",
      "Reginald Bitters"
    ],
    "url": "https://www.themoviedb.org/tv/31356-big-time-rush"
  },
  {
    "title": "Neon Genesis Evangelion",
    "overview": "At the turn of the century, the Angels returned to Earth, seeking to wipe out humanity in an apocalyptic fury. Devastated, mankind's last remnants moved underground to wait for the day when the Angels would come back to finish the job. Fifteen years later, that day has come... but this time, humanity is ready to fight back with terrifying bio-mechanical weapons known as the Evangelions. Watch as Shinji, Rei, Asuka and the rest of the mysterious shadow agency Nerv battle to save earth from total annihilation.",
    "cast": [
      "Rei Ayanami, Yui Ikari",
      "Shinji Ikari",
      "Misato Katsuragi",
      "Asuka Langley Soryu",
      "Dr. Ritsuko Akagi",
      "Gendo Ikari",
      "Kozo Fuyutsuki",
      "Maya Ibuki",
      "Makoto Hyuuga, Hyuuga Makoto"
    ],
    "url": "https://www.themoviedb.org/tv/890"
  },
  {
    "title": "Cardcaptor Sakura",
    "overview": "Sakura Kinomoto, an elementary school student who discovers that she possesses magical powers after accidentally freeing a set of magical cards from the book they had been sealed in for years. She is then tasked with retrieving those cards in order to avoid an unknown catastrophe from befalling the world.",
    "cast": [
      "Sakura Kinomoto",
      "Tomoyo Daidouji",
      "Syaoran Li",
      "Kerberos",
      "Naoko Yanagisawa",
      "Fujitaka Kinomoto",
      "Kerberos",
      "Yukito Tsukishiro",
      "Touya Kinomoto"
    ],
    "url": "https://www.themoviedb.org/tv/35790"
  },
  {
    "title": "The Last of Us",
    "overview": "Twenty years after modern civilization has been destroyed, Joel, a hardened survivor, is hired to smuggle Ellie, a 14-year-old girl, out of an oppressive quarantine zone. What starts as a small job soon becomes a brutal, heartbreaking journey, as they both must traverse the United States and depend on each other for survival.",
    "cast": [
      "Joel Miller",
      "Ellie Williams",
      "Tess",
      "Henry Burrell",
      "Perry",
      "Sam Burrell",
      "Dr. Edelstein",
      "Museum Clicker, Clicker"
    ],
    "url": "https://www.themoviedb.org/tv/100088-the-last-of-us"
  },
  {
    "title": "Gravity Falls",
    "overview": "Twin brother and sister Dipper and Mabel Pines are in for an unexpected adventure when they spend the summer helping their great uncle Stan run a tourist trap in the mysterious town of Gravity Falls, Oregon.",
    "cast": [
      "Dipper Pines",
      "Mabel Pines"
    ],
    "url": "https://www.themoviedb.org/tv/40075-gravity-falls"
  },
  {
    "title": "House",
    "overview": "Dr. Gregory House, a drug-addicted, unconventional, misanthropic medical genius, leads a team of diagnosticians at the fictional Princeton–Plainsboro Teaching Hospital in New Jersey.",
    "cast": [
      "Gregory House",
      "James Wilson",
      "Eric Foreman",
      "Robert Chase",
      "Lisa Cuddy",
      "Nurse, ER Doctor",
      "Allison Cameron",
      "Chris Taub",
      "Thirteen"
    ],
    "url": "https://www.themoviedb.org/tv/1408-house"
  },
  {
    "title": "The Chosen",
    "overview": "The life of Christ through the eyes of those who encountered him called The Chosen.",
    "cast": [
      "Jesus of Nazareth",
      "Simon Peter",
      "Mary Magdalene",
      "Matthew",
      "Andrew",
      "John",
      "Shmuel",
      "Thaddeus",
      "Little James"
    ],
    "url": "https://www.themoviedb.org/tv/85077-the-chosen"
  },
  {
    "title": "BLUE EYE SAMURAI",
    "overview": "Driven by a dream of revenge against those who made her an outcast in Edo-period Japan, a young warrior cuts a bloody path toward her destiny.",
    "cast": [
      "Mizu",
      "Seki",
      "Ringo",
      "The Swordmaker",
      "Akemi",
      "Taigen",
      "Heiji Shindo",
      "Abijah Fowler"
    ],
    "url": "https://www.themoviedb.org/tv/225180-blue-eye-samurai"
  },
  {
    "title": "InuYasha",
    "overview": "Kagome Higurashi is a modern day young girl who lives with her family by the old Higure shrine. Unbeknownst to Kagome, she is the reincarnation of priestess Kikyo and posseses the \"Jewel of Four Souls\" (the Shikon jewel). One ill-fated day, Kagome locates an ancient well near her home and is abruptly transported through the well and into a feudal Japan, inhabited by demons. There, she encounters Inuyasha, son of a powerful demon father and a human mother, who is pinned to a tree by an enchanted arrow.",
    "cast": [
      "InuYasha",
      "Kagome Higurashi",
      "Sango, Sango",
      "Kikyo, Kikyo",
      "Kagura, Kagura",
      "Miroku",
      "Sesshomaru",
      "Naraku",
      "Koga"
    ],
    "url": "https://www.themoviedb.org/tv/35610"
  },
  {
    "title": "The Spectacular Spider-Man",
    "overview": "Having spent the summer engaging common criminals with his new-found powers, not so typical 16-year-old Peter Parker must conceal his secret identity and battle super-villains in the real world as he enters his junior year of high school.",
    "cast": [
      "Peter Parker",
      "Gwen Stacy",
      "Flash Thompson",
      "Sally Avril",
      "Liz Allan",
      "Mary Jane Watson",
      "Harry Osborn",
      "May Parker",
      "George Stacy"
    ],
    "url": "https://www.themoviedb.org/tv/3854-the-spectacular-spider-man"
  },
  {
    "title": "Banana Fish",
    "overview": "Nature made Ash Lynx beautiful; nurture made him a cold ruthless killer. A runaway brought up as the adopted heir and sex toy of \"Papa\" Dino Golzine, Ash, now at the rebellious age of seventeen, forsakes the kingdom held out by the devil who raised him. But the hideous secret that drove Ash's older brother mad in Iraq has suddenly fallen into Papa's insatiably ambitious hands—and it's exactly the wrong time for Eiji Okamura, a pure-hearted young photographer from Japan, to make Ash Lynx's acquaintance.",
    "cast": [
      "Ash Lynx",
      "Eiji Okumura",
      "Dino Golzine",
      "Max Lobo",
      "Yut-Lung Lee",
      "Arthur Frederick",
      "Shorter Wong",
      "Yuen-Tai Lao",
      "Su Rin Sing"
    ],
    "url": "https://www.themoviedb.org/tv/80564"
  },
  {
    "title": "The Wire",
    "overview": "Told from the points of view of both the Baltimore homicide and narcotics detectives and their targets, the series captures a universe in which the national war on drugs has become a permanent, self-sustaining bureaucracy, and distinctions between good and evil are routinely obliterated.",
    "cast": [
      "Jimmy McNulty",
      "Cedric Daniels",
      "Kima Greggs",
      "Bunk Moreland",
      "Rhonda Pearlman",
      "Bubbles",
      "William Rawls",
      "Herc",
      "Ellis Carver"
    ],
    "url": "https://www.themoviedb.org/tv/1438-the-wire"
  },
  {
    "title": "Kaguya-sama: Love Is War",
    "overview": "Considered a genius due to having the highest grades in the country, Miyuki Shirogane leads the prestigious Shuchiin Academy's student council as its president, working alongside the beautiful and wealthy vice president Kaguya Shinomiya. The two are often regarded as the perfect couple by students despite them not being in any sort of romantic relationship.",
    "cast": [
      "Miyuki Shirogane",
      "Kaguya Shinomiya",
      "Chika Fujiwara",
      "Yuu Ishigami",
      "Ai Hayasaka",
      "Narration",
      "Nagisa Kashiwagi",
      "Miko Iino"
    ],
    "url": "https://www.themoviedb.org/tv/83121"
  },
  {
    "title": "JoJo's Bizarre Adventure",
    "overview": "Follow the intergenerational feud between the Joestar Family and various forces of evil, the most prominent of which is Dio Brando and his followers.",
    "cast": [
      "Jotaro Kujo",
      "DIO, Dio Brando",
      "Joseph Joestar",
      "Jean-Pierre Polnareff",
      "Noriaki Kakyoin",
      "Muhammad Avdol",
      "Koichi Hirose",
      "Leone Abbacchio",
      "Josuke Higashikata"
    ],
    "url": "https://www.themoviedb.org/tv/45790"
  },
  {
    "title": "Jujutsu Kaisen",
    "overview": "Yuji Itadori is a boy with tremendous physical strength, though he lives a completely ordinary high school life. One day, to save a classmate who has been attacked by curses, he eats the finger of Ryomen Sukuna, taking the curse into his own soul. From then on, he shares one body with Ryomen Sukuna. Guided by the most powerful of sorcerers, Satoru Gojo, Itadori is admitted to Tokyo Jujutsu High School, an organization that fights the curses... and thus begins the heroic tale of a boy who became a curse to exorcise a curse, a life from which he could never turn back.",
    "cast": [
      "Yuji Itadori",
      "Satoru Gojo",
      "Megumi Fushiguro",
      "Nobara Kugisaki",
      "Suguru Geto",
      "Mahito",
      "Kento Nanami",
      "Panda",
      "Kiyotaka Ijichi"
    ],
    "url": "https://www.themoviedb.org/tv/95479"
  },
  {
    "title": "Scissor Seven",
    "overview": "Seeking to recover his memory, a scissor-wielding, hairdressing, bungling quasi-assassin stumbles into a struggle for power among feuding factions.",
    "cast": [
      "梅花十三, 梅花十三(幼年)",
      "伍六七",
      "鸡大保, 青凤",
      "陈伯",
      "江主任",
      "春风一郎",
      "何大春",
      "曼珠沙华",
      "可乐, 小飞鸡"
    ],
    "url": "https://www.themoviedb.org/tv/79141"
  },
  {
    "title": "The Office",
    "overview": "The everyday lives of office employees in the Scranton, Pennsylvania branch of the fictional Dunder Mifflin Paper Company.",
    "cast": [
      "Kevin Malone",
      "Angela Martin",
      "Óscar Martínez",
      "Meredith Palmer",
      "Creed Bratton",
      "Stanley Hudson",
      "Phyllis Lapin",
      "Dwight Schrute",
      "Pam Beesly"
    ],
    "url": "https://www.themoviedb.org/tv/2316-the-office"
  },
  {
    "title": "Metal Family",
    "overview": "Metal Family follows the daily lives of Glam and Victoria, two metal fans that fell in love and had two children together, Dee and Heavy.",
    "cast": [
      "Glam",
      "Heavy",
      "Victoria"
    ],
    "url": "https://www.themoviedb.org/tv/123566-metal-family"
  },
  {
    "title": "High School D×D",
    "overview": "High school student Issei Hyoudou is your run-of-the-mill pervert who does nothing productive with his life, peeping on women and dreaming of having his own harem one day. Things seem to be looking up for Issei when a beautiful girl asks him out on a date, although she turns out to be a fallen angel who brutally kills him! However, he gets a second chance at life when beautiful senior student Rias Gremory, who is a top-class devil, revives him as her servant, recruiting Issei into the ranks of the school's Occult Research club.",
    "cast": [
      "Issei Hyōdō",
      "Rias Gremory",
      "Asia Argento",
      "Akeno Himejima",
      "Koneko Tōjō",
      "Grayfia",
      "Xenovia",
      "Yūto Kiba"
    ],
    "url": "https://www.themoviedb.org/tv/45950-dxd"
  },
  {
    "title": "KONOSUBA - God's blessing on this wonderful world!",
    "overview": "After a traffic accident, Kazuma Sato’s disappointingly brief life was supposed to be over, but he wakes up to see a beautiful girl before him. She claims to be a goddess, Aqua, and asks if he would like to go to another world and bring only one thing with him. Kazuma decides to bring the goddess herself, and they are transported to a fantasy world filled with adventure, ruled by a demon king. Now Kazuma only wants to live in peace, but Aqua wants to solve many of this world’s problems, and the demon king will only turn a blind eye for so long…",
    "cast": [
      "Kazuma Satou",
      "Aqua",
      "Megumin",
      "Lalatina 'Darkness' Dustiness Ford",
      "Luna, Female Priest"
    ],
    "url": "https://www.themoviedb.org/tv/65844"
  },
  {
    "title": "Business Proposal",
    "overview": "In disguise as her friend, Ha-ri shows up to a blind date to scare him away. But plans go awry when he turns out to be her CEO — and makes a proposal.",
    "cast": [
      "Kang Tae-moo",
      "Shin Ha-ri",
      "Cha Sung-hoon",
      "Jin Young-seo",
      "Kang Da-goo",
      "Shin Joong-hae",
      "Han Mi-mo",
      "Yeo Eui-joo",
      "Lee Min-woo"
    ],
    "url": "https://www.themoviedb.org/tv/154825"
  },
  {
    "title": "Villainous",
    "overview": "Follow the misadventures of the Black Hat Org. with evil handyman Black Hat and his less evil aides Dr. Flugslys, Demencia, 5.0.5, Cam Bot, and Penumbra.",
    "cast": [
      "Dr. Flugslys",
      "Demencia",
      "Black Hat",
      "5.0.5"
    ],
    "url": "https://www.themoviedb.org/tv/98214-villanos"
  },
  {
    "title": "Tomorrow",
    "overview": "Once guiding the 'dead', now saving those who want to die! The Afterlife Office Human Fantasy.",
    "cast": [
      "Choi Jun-woong",
      "Goo Ryeon",
      "Im Ryung-gu",
      "Park Joong-gil",
      "Jeon Soo-in",
      "Jade Emperor",
      "Jang Jae-hee",
      "Namgung Jae-soo",
      "Lee Jeong-im"
    ],
    "url": "https://www.themoviedb.org/tv/136369"
  },
  {
    "title": "Amphibia",
    "overview": "The adventures of 13-year-old, self-centered Anne Boonchuy who is magically transported to the fictitious world of Amphibia, a rural marshland full of frog-people. With the help of an excitable young frog named Sprig, Anne will become a hero and discover the first true friendship of her life.",
    "cast": [
      "Anne Boonchuy",
      "Sprig Plantar",
      "Hopediah Plantar",
      "Polly Plantar",
      "Mrs. Boonchuy",
      "Mr. Boonchuy",
      "Mayor Toadstool",
      "One-Eyed Wally",
      "Sadie Croaker"
    ],
    "url": "https://www.themoviedb.org/tv/85349-amphibia"
  },
  {
    "title": "SPY x FAMILY",
    "overview": "World peace is at stake and secret agent Twilight must undergo his most difficult mission yet—pretend to be a family man. Posing as a loving husband and father, he'll infiltrate an elite school to get close to a high-profile politician. He has the perfect cover, except his wife's a deadly assassin and neither knows each other's identity. But someone does: his adopted daughter, who's a telepath!",
    "cast": [
      "Loid Forger",
      "Anya Forger",
      "Yor Forger",
      "Bond Forger",
      "Emile Elman",
      "Vides",
      "Gram Gretcher"
    ],
    "url": "https://www.themoviedb.org/tv/120089-spyxfamily"
  },
  {
    "title": "Your Lie in April",
    "overview": "Kousei Arima was a genius pianist until his mother's sudden death took away his ability to play. Each day was dull for Kousei. But, then he meets a violinist named Kaori Miyazono who has an eccentric playing style. Can the heartfelt sounds of the girl's violin lead the boy to play the piano again?",
    "cast": [
      "Kousei Arima",
      "Kaori Miyazono",
      "Tsubaki Sawabe",
      "Ryouta Watari",
      "Hiroko Seto",
      "Takeshi Aiza",
      "Emi Igawa",
      "Nao Kashiwagi",
      "Saki Arima"
    ],
    "url": "https://www.themoviedb.org/tv/61663"
  },
  {
    "title": "Over the Garden Wall",
    "overview": "Two brothers, Wirt and Greg, find themselves lost in the Unknown; a strange forest adrift in time. With the help of a wise old Woodsman and a foul-tempered bluebird named Beatrice, Wirt and Greg must travel across this strange land, in hope of finding their way home. Join them as they encounter surprises and obstacles on their journey through the wood.",
    "cast": [
      "Wirt",
      "Gregory",
      "Beatrice",
      "The Beast",
      "The Woodsman",
      "Gregory's Frog",
      "Quincy Endicott",
      "Adelaide",
      "Old Man Langtree",
      "Sara"
    ],
    "url": "https://www.themoviedb.org/tv/61617-over-the-garden-wall"
  },
  {
    "title": "Rascal Does Not Dream of Bunny Girl Senpai",
    "overview": "Puberty Syndrome—a rumored, mysterious syndrome that only affects those in their puberty. For example, a bunny girl suddenly appeared in front of Sakuta Azusagawa. The bunny girl's real identity is Mai Sakurajima, a teenage celebrity who is currently an inactive high school senior. For some reason, her charming figure does not reflect in the eyes of others. In the course of revealing the mystery behind this phenomenon, Sakuta begins to explore his feelings towards Mai. Set in a city where the skies and seas shine, Sakuta unfolds the meaning behind his bizarre encounters on women with the said syndrome.",
    "cast": [
      "Sakuta Azusagawa",
      "Mai Sakurajima",
      "Tomoe Koga",
      "Rio Futaba",
      "Nodoka Toyohama",
      "Kaede Azusagawa",
      "Shoko Makinohara",
      "Yuma Kunimi"
    ],
    "url": "https://www.themoviedb.org/tv/82739"
  },
  {
    "title": "Crash Landing on You",
    "overview": "A paragliding mishap drops a South Korean heiress in North Korea -- and into the life of an army officer, who decides he will help her hide.",
    "cast": [
      "Lee Jung-hyeok",
      "Yoon Se-ri",
      "Seo Dan",
      "Koo Seung-joon",
      "Pyo Chi-soo",
      "Park Gwang-beom",
      "Kim Joo-meok",
      "Geum Eun-dong",
      "Jo Cheol-kang"
    ],
    "url": "https://www.themoviedb.org/tv/94796"
  },
  {
    "title": "It's Okay to Not Be Okay",
    "overview": "Desperate to escape from his emotional baggage and the heavy responsibility he’s had all his life, a psychiatric ward worker begins to heal with help from the unexpected – a woman who writes fairy tales but doesn’t believe in them.",
    "cast": [
      "Moon Gang-tae",
      "Ko Moon-young",
      "Nam Joo-ri",
      "Moon Sang-tae",
      "Lee Sang-in",
      "Oh Ji-wang",
      "Park Haeng-ja",
      "Kang Soon-deok",
      "Jo Sae-joo"
    ],
    "url": "https://www.themoviedb.org/tv/96462"
  },
  {
    "title": "Digimon Tamers",
    "overview": "A group of 12-year-old fans of the Digimon card game meet their own Digimon friends and start to duel \"bio-emerging\" Digimon who cross the barrier between the information network and their world.",
    "cast": [
      "Takato Matsuda",
      "Guilmon / Narrator",
      "Ruki Makino",
      "Renamon",
      "Li Jianliang",
      "Terriermon",
      "Culumon",
      "Juri Katou"
    ],
    "url": "https://www.themoviedb.org/tv/9302"
  },
  {
    "title": "Real Girl",
    "overview": "Tsutsui Hikari (a.k.a \"Tsuttsun\") is a high school student who is content with his virtual life of anime and video games. One day, he gets stuck cleaning the pool with Iroha, a real live girl who is stylish, sassy and known to be easy with boys ... and she aggressively approaches him! Tsuttsun, who has few friends and lives in his own world, finds himself smitten by the confident and wild Iroha ... and his whole world is turned upside down!! It's the awkward and pure love story of a boy who experiences relationship for the first time.",
    "cast": [
      "Hikari Tsutsui",
      "Iroha Igarashi",
      "Sumie Ayado",
      "Ezomichi",
      "Arisa Ishino",
      "Yuuto Itou",
      "Mitsuya Takanashi"
    ],
    "url": "https://www.themoviedb.org/tv/77721"
  },
  {
    "title": "BoJack Horseman",
    "overview": "Meet the most beloved sitcom horse of the 90s - 20 years later. BoJack Horseman was the star of the hit TV show \"Horsin' Around,\" but today he's washed up, living in Hollywood, complaining about everything, and wearing colorful sweaters.",
    "cast": [
      "BoJack Horseman",
      "Todd Chavez",
      "Diane Nguyen",
      "Princess Carolyn",
      "Mr. Peanutbutter",
      "Tom Jumbo-Grumbo",
      "Judah Mannowdog"
    ],
    "url": "https://www.themoviedb.org/tv/61222-bojack-horseman"
  },
  {
    "title": "31 Minutos",
    "overview": "Chilean television show which takes the form of a mock news broadcast, and is fronted by puppets who present various items.",
    "cast": [
      "Tulio Triviño",
      "Juan Carlos Bodoque",
      "Policarpo Avendaño",
      "Juanín Juan Harry",
      "Patana Tufillo",
      "Guaripolo",
      "Dante Torobolino",
      "Bongo Stingo",
      "Pompón",
      "Nibaldo Churreto",
      "Señor Manguera"
    ],
    "url": "https://www.themoviedb.org/tv/43-31-minutos"
  },
  {
    "title": "DARLING in the FRANXX",
    "overview": "The story is set in the distant future. The land is ruined, and humanity establishes the mobile fort city Plantation. Pilots produced inside Plantation live in Mistilteinn, also know as the \"birdcage.\" Children live there knowing nothing of the outside world or the freedom of the sky. Their lives consist of battling to carry out missions. Their enemies are mysterious giant lifeforms known as Kyouryuu, and the children pilot robots called Franxx to face off against them. For the children, riding the Franxx proves their existence.",
    "cast": [
      "Hiro",
      "Zero Two",
      "Ichigo",
      "Gorou",
      "Miku",
      "Kokoro",
      "Nana",
      "Ikuno",
      "Zorome"
    ],
    "url": "https://www.themoviedb.org/tv/76121"
  },
  {
    "title": "Dr. STONE",
    "overview": "One fateful day, all of humanity was petrified by a blinding flash of light. After several millennia, high schooler Taiju awakens and finds himself lost in a world of statues. However, he's not alone! His science-loving friend Senku's been up and running for a few months and he's got a grand plan in mind, to kickstart civilization with the power of science!",
    "cast": [
      "Senku Ishigami",
      "Kohaku",
      "Taiju Oki",
      "Yuzuriha Ogawa",
      "Tsukasa",
      "Chrome",
      "Ginro",
      "Narrator",
      "Science Club Member"
    ],
    "url": "https://www.themoviedb.org/tv/86031-dr-stone"
  },
  {
    "title": "Dororo",
    "overview": "A samurai lord has bartered away his newborn son's organs to forty-eight demons in exchange for dominance on the battlefield. Yet, the abandoned infant survives thanks to a medicine man who equips him with primitive prosthetics—lethal ones with which the wronged son will use to hunt down the multitude of demons to reclaim his body one piece at a time, before confronting his father. On his journeys the young hero encounters an orphan who claims to be the greatest thief in Japan.",
    "cast": [
      "Dororo",
      "Hyakkimaru",
      "Daigo Kagemitsu",
      "Jukai",
      "Tahoumaru",
      "Biwamaru"
    ],
    "url": "https://www.themoviedb.org/tv/83100"
  },
  {
    "title": "Dickinson",
    "overview": "Emily Dickinson. Poet. Daughter. Total rebel. In this coming-of-age story, Emily’s determined to become the world’s greatest poet.",
    "cast": [
      "Emily Dickinson",
      "Edward Dickinson",
      "Austin Dickinson",
      "Lavinia 'Vinnie' Dickinson",
      "Sue Gilbert",
      "Mrs. Dickinson",
      "Henry",
      "Abby Wood",
      "Toshiaki"
    ],
    "url": "https://www.themoviedb.org/tv/89901-dickinson"
  },
  {
    "title": "My Demon",
    "overview": "A pitiless demon becomes powerless after getting entangled with an icy heiress, who may hold the key to his lost abilities — and his heart.",
    "cast": [
      "Do Do-hee",
      "Jeong Gu-won",
      "Ju Seok-hoon",
      "Ju Cheon-suk",
      "Jin Ga-young",
      "Noh Suk-min",
      "Kim Se-ra",
      "Noh Su-ahn",
      "Shin Da-jeong"
    ],
    "url": "https://www.themoviedb.org/tv/218539"
  },
  {
    "title": "Golden Time",
    "overview": "Banri Tada is a freshman at a Tokyo law school. After an accident, he suffers severe memory loss. Despite the incident, he befriends fellow freshman, Mitsuo Yanagisawa, which leads him to the beautiful, yet obsessive, Kouko Kaga.",
    "cast": [
      "Kouko Kaga",
      "Banri Tada",
      "Nana Hayashida",
      "Mitsuo Yanagisawa",
      "Chinami Oka",
      "Nijigen-kun",
      "Kosshii-senpai",
      "Nana-senpai",
      "Male senior A, Man B"
    ],
    "url": "https://www.themoviedb.org/tv/67389"
  },
  {
    "title": "Given",
    "overview": "Tightly clutching his Gibson guitar, Mafuyu Satou steps out of his dark apartment to begin another day of his high school life. While taking a nap in a quiet spot on the gymnasium staircase, he has a chance encounter with fellow student Ritsuka Uenoyama, who berates him for letting his guitar's strings rust and break. Noticing Uenoyama's knowledge of the instrument, Satou pleads for him to fix it and to teach him how to play. Uenoyama eventually agrees and invites him to sit in on a jam session with his two band mates: bassist Haruki Nakayama and drummer Akihiko Kaji.",
    "cast": [
      "Mafuyu Satou",
      "Ritsuka Uenoyama",
      "Haruki Nakayama",
      "Akihiko Kaji",
      "Hiiragi Kashima"
    ],
    "url": "https://www.themoviedb.org/tv/88040"
  },
  {
    "title": "The Umbrella Academy",
    "overview": "A dysfunctional family of superheroes comes together to solve the mystery of their father's death, the threat of the apocalypse and more.",
    "cast": [
      "Number Five",
      "Vanya Hargreeves",
      "Luther Hargreeves",
      "Allison Hargreeves",
      "Klaus Hargreeves",
      "Diego Hargreeves",
      "Ben Hargreeves",
      "Sir Reginald Hargreeves",
      "Lila Pitts"
    ],
    "url": "https://www.themoviedb.org/tv/75006-the-umbrella-academy"
  },
  {
    "title": "Mr. Queen",
    "overview": "In the modern age, Jang Bong-hwan is a chef who works for the country's top politicians at the Blue House. He has a free spirit, but he one day finds himself in the body of Queen Cheorin in the Joseon period.",
    "cast": [
      "Queen Cheo-rin",
      "King Cheol-jong",
      "Queen Sunwon",
      "Kim Jwa-geun",
      "Jo Hwa-jin",
      "Kim Byeong-in",
      "Court Lady Choi",
      "Hong-yeon",
      "Manbok"
    ],
    "url": "https://www.themoviedb.org/tv/108261"
  },
  {
    "title": "Yuri!!! on Ice",
    "overview": "Yuuri Katsuki carried all of Japan's hopes on his shoulders to win at the Gran Prix Finale ice skating competition, but suffered a crushing defeat. He returns home to Kyushu and half feels like he wants to retire, and half feels like he wants to continue ice skating. Suddenly the five-time consecutive world championship ice skater Victor Nikiforov appears before him with Yuri Plisetsky, a young Russian figure skater who is already defeating his seniors. Victor and both Yuris take up the challenge on an unprecedented Gran Prix series.",
    "cast": [
      "Yuuri Katsuki",
      "Victor Nikiforov",
      "Yuri Plisetsky"
    ],
    "url": "https://www.themoviedb.org/tv/68129-on-ice"
  },
  {
    "title": "Horimiya",
    "overview": "A secret life is the one thing they have in common. At school, Hori is a prim and perfect social butterfly, but the truth is she's a brash homebody. Meanwhile, under a gloomy facade, Miyamura hides a gentle heart, along with piercings and tattoos. In a chance meeting, they both reveal a side they've never shown. Could this blossom into something new?",
    "cast": [
      "Kyoko Hori",
      "Izumi Miyamura",
      "Toru Ishikawa",
      "Yuki Yoshikawa",
      "Kakeru Sengoku",
      "Remi Ayasaki",
      "Sakura Kono",
      "Shu Iura",
      "Akane Yanagi"
    ],
    "url": "https://www.themoviedb.org/tv/110070"
  },
  {
    "title": "The Rising of the Shield Hero",
    "overview": "Iwatani Naofumi, a run-of-the-mill otaku, finds a book in the library that summons him to another world. He is tasked with joining the sword, spear, and bow as one of the Four Cardinal Heroes and fighting the Waves of Catastrophe as the Shield Hero. Excited by the prospect of a grand adventure, Naofumi sets off with his party. However, merely a few days later, he is betrayed and loses all his money, dignity, and respect. Unable to trust anyone anymore, he employs a slave named Raphtalia and takes on the Waves and the world. But will he really find a way to overturn this desperate situation?",
    "cast": [
      "Naofumi Iwatani",
      "Raphtalia",
      "Filo",
      "Melty Q Melromarc",
      "Elhart",
      "Ren Amaki",
      "Mirellia Q Melromarc",
      "Motoyasu Kitamura",
      "Glass"
    ],
    "url": "https://www.themoviedb.org/tv/83095"
  },
  {
    "title": "Band of Brothers",
    "overview": "Drawn from interviews with survivors of Easy Company, as well as their journals and letters, Band of Brothers chronicles the experiences of these men from paratrooper training in Georgia through the end of the war. As an elite rifle company parachuting into Normandy early on D-Day morning, participants in the Battle of the Bulge, and witness to the horrors of war, the men of Easy knew extraordinary bravery and extraordinary fear - and became the stuff of legend. Based on Stephen E. Ambrose's acclaimed book of the same name.",
    "cast": [
      "Richard D. Winters",
      "C. Carwood Lipton",
      "Herbert Sobel",
      "David Kenyon Webster",
      "Lewis Nixon",
      "Ronald Speirs",
      "Denver 'Bull' Randleman",
      "Lynn 'Buck' Compton",
      "Donald Malarkey"
    ],
    "url": "https://www.themoviedb.org/tv/4613-band-of-brothers"
  },
  {
    "title": "Chainsaw Man",
    "overview": "Denji has a simple dream—to live a happy and peaceful life, spending time with a girl he likes. This is a far cry from reality, however, as Denji is forced by the yakuza into killing devils in order to pay off his crushing debts. Using his pet devil Pochita as a weapon, he is ready to do anything for a bit of cash.",
    "cast": [
      "Denji",
      "Makima",
      "Aki Hayakawa",
      "Power",
      "Himeno",
      "Kobeni",
      "Arai",
      "Kishibe",
      "Pochita"
    ],
    "url": "https://www.themoviedb.org/tv/114410"
  },
  {
    "title": "Our Planet",
    "overview": "Experience our planet's natural beauty and examine how climate change impacts all living creatures in this ambitious documentary of spectacular scope.",
    "cast": [
      "Self - Narrator"
    ],
    "url": "https://www.themoviedb.org/tv/83880-our-planet"
  },
  {
    "title": "Vincenzo",
    "overview": "At the age of eight, Park Joo Hyeong left for Italy after being adopted. Now an adult, he is known as Vincenzo Cassano and employed by a Mafia family as a consigliere. Due to warring Mafia factions, he flies to South Korea where he gets involved with lawyer Hong Cha Young. She is the type of attorney who will do anything to win a case. Now back in his motherland, he gives an unrivalled conglomerate a taste of his own medicine—with a side of his own version of justice.",
    "cast": [
      "Vincenzo Cassano",
      "Hong Cha-young",
      "Jang Joon-woo",
      "Choi Myung-hee",
      "Jang Han-seo",
      "Han Seung-hyuk",
      "An Gi-seok",
      "Nam Joo-sung",
      "Seo Mi-ri"
    ],
    "url": "https://www.themoviedb.org/tv/117376"
  },
  {
    "title": "Naruto Shippūden",
    "overview": "After 2 and a half years Naruto finally returns to his village of Konoha, and sets about putting his ambitions to work. It will not be easy though as he has amassed a few more dangerous enemies, in the likes of the shinobi organization; Akatsuki.",
    "cast": [
      "Naruto Uzumaki",
      "Sasuke Uchiha",
      "Sakura Haruno",
      "Kakashi Hatake",
      "Shikamaru Nara",
      "Sai",
      "Gaara",
      "Itachi Uchiha",
      "Neji Hyuga"
    ],
    "url": "https://www.themoviedb.org/tv/31910"
  },
  {
    "title": "Scarlet Heart: Ryeo",
    "overview": "A story of a 25-year-old Go Hajin who is transported back in time to the Goryeo Dynasty. She then wakes up in the body of Lady Hae Soo and finds herself amongst the ruling princes of the Wang Family.",
    "cast": [
      "Go Hajin",
      "Wang So",
      "Wang Wook",
      "Wang Yo",
      "Wang Eun",
      "Wang Baeka",
      "Wang Jeong",
      "Wang Won",
      "Wang Mu"
    ],
    "url": "https://www.themoviedb.org/tv/66433"
  },
  {
    "title": "Young Royals",
    "overview": "Prince Wilhelm adjusts to life at his prestigious new boarding school, Hillerska, but following his heart proves more challenging than anticipated.",
    "cast": [
      "Wilhelm of Sweden",
      "Simon Eriksson",
      "August Horn of Årnäs",
      "Sara Eriksson",
      "Felice Ehrencrona",
      "Nils",
      "Vincent",
      "Madison McCoy",
      "Stella Truedsson"
    ],
    "url": "https://www.themoviedb.org/tv/125910-young-royals"
  },
  {
    "title": "ORESUKI Are you the only one who loves me?",
    "overview": "Kisaragi Amatsuyu is invited out alone by the cool beauty upperclassman Cosmos and his childhood friend Himawari. Expecting to hear their confessions, he triumphantly goes to meet each of them in turn. But Cosmos and Himawari both instead confess to Amatsuyu that they like his friend. Amatsuyu fights this lonely battle, but there is another girl who is looking at him. She is a gloomy girl with glasses and braids. Amatsuyu finds that he hates her, because she's always turning her sharp tongue only on him and finding enjoyment in his troubles. But it turns out that she's the only one who actually does like him.",
    "cast": [
      "Amatsuyu Kisaragi",
      "Sumireko Sanshokuin",
      "Aoi Hinata",
      "Sakura Akino",
      "Taiyou Ooga",
      "Hina Hanetachi",
      "Asaka Mayama",
      "Chiharu Youki"
    ],
    "url": "https://www.themoviedb.org/tv/93019"
  },
  {
    "title": "Hotel Del Luna",
    "overview": "When he's invited to manage a hotel for dead souls, an elite hotelier gets to know the establishment's ancient owner and her strange world.",
    "cast": [
      "Jang Man-wol",
      "Goo Chan-sung",
      "Kim Sun-bi",
      "Choi Seo-hee",
      "Ji Hyun-joong",
      "Go Chung-myung",
      "Kim Yoo-na",
      "Sanchez",
      "God Mago"
    ],
    "url": "https://www.themoviedb.org/tv/90447"
  },
  {
    "title": "Arifureta: From Commonplace to World's Strongest",
    "overview": "Hajime Nagumo and his high school class are suddenly summoned to a fantastical land as heroes. But while most of his classmates have powerful stats and abilities, Hajime does not. Underappreciated and unprepared, he tumbles into the depths of a monster-infested dungeon where voracity and sacrifice are his only options. To thrive in this savage world, he’ll have no choice but to welcome the abyss.",
    "cast": [
      "Hajime Nagumo",
      "Yue",
      "Shea Haulia",
      "Tio Klarus",
      "Kaori Shirasaki",
      "Shizuku Yaegashi",
      "Aiko Hatayama",
      "Noint, Nun",
      "Myu"
    ],
    "url": "https://www.themoviedb.org/tv/86034"
  },
  {
    "title": "Peaky Blinders",
    "overview": "A gangster family epic set in 1919 Birmingham, England and centered on a gang who sew razor blades in the peaks of their caps, and their fierce boss Tommy Shelby, who means to move up in the world.",
    "cast": [
      "Thomas Shelby",
      "Arthur Shelby",
      "Ada Shelby",
      "Polly Gray",
      "Michael Gray",
      "Charlie Strong, Charlie Strong",
      "Finn Shelby, Finn Shelby",
      "John Shelby",
      "Lizzie Stark"
    ],
    "url": "https://www.themoviedb.org/tv/60574-peaky-blinders"
  },
  {
    "title": "Cowboy Bebop",
    "overview": "In 2071, roughly fifty years after an accident with a hyperspace gateway made the Earth almost uninhabitable, humanity has colonized most of the rocky planets and moons of the Solar System. Amid a rising crime rate, the Inter Solar System Police (ISSP) set up a legalized contract system, in which registered bounty hunters, also referred to as \"Cowboys\", chase criminals and bring them in alive in return for a reward.",
    "cast": [
      "Spike Spiegel",
      "Jet Black",
      "Faye Valentine",
      "Edward Wong Hau Pepelu Tivruski IV",
      "Police,",
      "Jobim",
      "Punch",
      "Judy",
      "Carlos"
    ],
    "url": "https://www.themoviedb.org/tv/30991"
  },
  {
    "title": "Death's Game",
    "overview": "At the brink of going to hell, Yee-jae must cycle through twelve separate lives and twelve separate deaths in this reincarnation drama.",
    "cast": [
      "Choi Yee-jae",
      "Death",
      "Choi Yee-jae's Mother",
      "Park Tae-woo",
      "Lee Ji-soo",
      "Ahn Ji-hyung",
      "Jang Gun-woo",
      "Kim Eun-jae",
      "Park Jin-tae"
    ],
    "url": "https://www.themoviedb.org/tv/218230"
  },
  {
    "title": "Batman: The Animated Series",
    "overview": "Vowing to avenge the murder of his parents, Bruce Wayne devotes his life to wiping out crime in Gotham City as the masked vigilante \"Batman\".",
    "cast": [
      "Batman",
      "Alfred Pennyworth",
      "Commissioner Gordon",
      "Robin",
      "Summer Gleeson",
      "Rupert Thorne"
    ],
    "url": "https://www.themoviedb.org/tv/2098-batman-the-animated-series"
  },
  {
    "title": "Mushoku Tensei: Jobless Reincarnation",
    "overview": "A 34-year-old hikikomori is kicked out of his home by his family after the death of his parents. After his eviction, he saves a group of teenagers from being killed by a speeding truck, but loses his life in the process. When he comes to, he realizes he has been reborn as Rudeus Greyrat, in a world of swords and sorcery.",
    "cast": [
      "Sylphiette",
      "Rudeus Greyrat",
      "Roxy Migurdia",
      "Eris Boreas Greyrat",
      "Elinalise Dragonroad",
      "Zanoba Shirone",
      "Norn Greyrat",
      "Luke Notos Greyrat"
    ],
    "url": "https://www.themoviedb.org/tv/94664"
  },
  {
    "title": "Shōgun",
    "overview": "In Japan in the year 1600, at the dawn of a century-defining civil war, Lord Yoshii Toranaga is fighting for his life as his enemies on the Council of Regents unite against him, when a mysterious European ship is found marooned in a nearby fishing village.",
    "cast": [
      "Yoshii Toranaga",
      "John Blackthorne",
      "Toda Mariko",
      "Kashigi Yabushige",
      "Ishido Kazunari",
      "Father Martin Alvito",
      "Ochiba No Kata",
      "Takemaru",
      "Setsu"
    ],
    "url": "https://www.themoviedb.org/tv/126308-shogun"
  },
  {
    "title": "My Holo Love",
    "overview": "Unexpected love finds a lonely woman when she forms a connection with a humanlike hologram who looks exactly like his prickly creator.",
    "cast": [
      "Ko Nan-do",
      "Han So-yeon",
      "Ko Yoo-jin",
      "Baek Chan-sung",
      "So-yeon's mother",
      "Yoo Ram",
      "Nam Gi-Ho",
      "Jo Jin-Seok",
      "Ji Na"
    ],
    "url": "https://www.themoviedb.org/tv/96160"
  },
  {
    "title": "Overlord",
    "overview": "In the year 2138, virtual reality gaming is booming. Yggdrasil, a popular online game is quietly shut down one day. However, one player named Momonga decides to not log out. Momonga is then transformed into the image of a skeleton as \"the most powerful wizard.\" The world continues to change, with non-player characters (NPCs) beginning to feel emotion. Having no parents, friends, or place in society, this ordinary young man Momonga then strives to take over the new world the game has become.",
    "cast": [
      "Solution Epsilon",
      "Momonga",
      "Albedo",
      "Shalltear Bloodfallen",
      "Narberal Gamma",
      "Virtuous King of the Forest",
      "Clementine",
      "Nfirea Bareare",
      "Aura Bella Fiora"
    ],
    "url": "https://www.themoviedb.org/tv/64196"
  },
  {
    "title": "My Dress-Up Darling",
    "overview": "Wakana Gojo is a high school boy who wants to become a kashirashi--a master craftsman who makes traditional Japanese Hina dolls. Though he's gung-ho about the craft, he knows nothing about the latest trends, and has a hard time fitting in with his class. The popular kids--especially one girl, Marin Kitagawa--seem like they live in a completely different world. That all changes one day, when she shares an unexpected secret with him, and their completely different worlds collide.",
    "cast": [
      "Marin Kitagawa",
      "Wakana Gojo",
      "Sajuna Inui",
      "Shinju Inui",
      "Kaoru Gojo",
      "Young Wakana",
      "Narration, Miori Gojo",
      "Nowa Sugaya",
      "Rune, Veronica"
    ],
    "url": "https://www.themoviedb.org/tv/123249"
  },
  {
    "title": "Rurouni Kenshin",
    "overview": "The Meiji Era was one of great renewal for Japan, where swords and killing were outlawed. However, many survivors from the time of Revolution still live, lurking in the shadows and waiting for a chance to use their killing blades again. Only Kenshin Himura, formerly one of the most brutal of killers, hopes to keep his swordsman's honor and still live in the new era.",
    "cast": [
      "Kenshin Himura",
      "Kaoru Kamiya",
      "Yahiko Myoujin",
      "Sanosuke Sagara",
      "Megumi Takani",
      "Hajime Saitô",
      "Makimachi Misao",
      "Aoshi Shinomori",
      "Gensai"
    ],
    "url": "https://www.themoviedb.org/tv/28136"
  },
  {
    "title": "I'm in the Band",
    "overview": "Tripp Campbell is the new lead guitarist for Iron Weasel, a band that once ruled the world of 80s pop metal. Can he push the washed-up rockers out of his parents' guest room and back in the limelight?",
    "cast": [
      "Tripp Campbell",
      "Derek Jupiter",
      "Izzy Fuentes",
      "Burger Pitt",
      "Ash",
      "Lassi",
      "Officer taylor"
    ],
    "url": "https://www.themoviedb.org/tv/21650-i-m-in-the-band"
  },
  {
    "title": "Jewel in the Palace",
    "overview": "Orphaned Jang-geum becomes the first female physician in the Joseon Dynasty and her determination is tested when people around her start showing their true faces.",
    "cast": [
      "Seo Jang-geum",
      "Min Jeong-ho",
      "King Jungjong",
      "Park Yeol-yi",
      "Na Joo-daek",
      "Young Jang-geum",
      "Oh Gyeom-ho",
      "Seo Cheon-soo",
      "Ja Sun Dowager Queen"
    ],
    "url": "https://www.themoviedb.org/tv/333"
  },
  {
    "title": "Shaman King",
    "overview": "Asakura Yoh is a shaman, a person who communicates with ghosts. He enters the Shaman Fight, for whoever wins the tournament gets to commune with the Great Spirit, God . . . that and his fiance Anna wants to be the wife of the Shaman King. Helping him are his friends Manta, Horo Horo, Ryu, and his samurai ghost partner, Amidamaru.",
    "cast": [
      "Manta Oyamada",
      "Amidamaru",
      "Rio",
      "Yoh Asakura",
      "Anna Kyōyama",
      "Ren Tao",
      "Faust VIII",
      "Lyserg",
      "Horohoro"
    ],
    "url": "https://www.themoviedb.org/tv/40143"
  },
  {
    "title": "Snowdrop",
    "overview": "In 1987, bloodied man Soo-ho jumps into a women's university dormitory in Seoul. Yeong-ro, a female student who fell in love with him at a group blind date, tends to his wounds as the dormitory is ensnared in intense surveillance. As Soo-ho's secrets unravel, he must eventually face the conflict between his heart to Yeong-ro and responsibility to his comrades, as well as to his sibling who awaits him in his home country. What will be of their fate?",
    "cast": [
      "Lim Soo-ho",
      "Eun Yoeng-ro",
      "Kang Cheong-ya",
      "Lee Kang-moo",
      "Pi Seung-hee",
      "Kye Boon-ok",
      "Jang Han-na",
      "Eun Chang-soo",
      "Nam Tae-il"
    ],
    "url": "https://www.themoviedb.org/tv/108291"
  },
  {
    "title": "Sherlock",
    "overview": "A modern update finds the famous sleuth and his doctor partner solving crime in 21st century London.",
    "cast": [
      "Sherlock Holmes",
      "Molly Hooper",
      "Mrs. Hudson",
      "DI Greg Lestrade",
      "John Watson",
      "Mycroft Holmes",
      "Jim Moriarty",
      "Dr Anderson",
      "Mary Morstan"
    ],
    "url": "https://www.themoviedb.org/tv/19885-sherlock"
  },
  {
    "title": "Cyberpunk: Edgerunners",
    "overview": "In a dystopia riddled with corruption and cybernetic implants, a talented but reckless street kid strives to become a mercenary outlaw — an edgerunner.",
    "cast": [
      "David Martinez",
      "Lucy",
      "Kiwi",
      "Faraday",
      "Ripperdoc",
      "Rebecca",
      "Falco",
      "Maine"
    ],
    "url": "https://www.themoviedb.org/tv/105248"
  },
  {
    "title": "Candy Candy",
    "overview": "This story is about a girl, Candy, who is a orphan. She is a nice and optimistic girl and she has a warm heart. When she was a child, she lived in an orphanage called Pony's Home. She had a good friend called Ann. And she met the \"handsome boy on the hill\" who is a important person in her life, on the hill behind the orphanage.",
    "cast": [
      "Candice White Ardlay",
      "William Albert Ardlay",
      "Terrence Graham Grandchester",
      "Anthony Brown",
      "Alistair Cornwell",
      "Archibald Cornwell",
      "Annie Brighton",
      "Patricia O'Brien",
      "Eliza Leagan"
    ],
    "url": "https://www.themoviedb.org/tv/9160"
  },
  {
    "title": "The Glory",
    "overview": "After a childhood marked by pain and violence, a woman puts a carefully planned revenge scheme in motion.",
    "cast": [
      "Moon Dong-eun",
      "Joo Yeo-jeong",
      "Park Yeon-jin",
      "Kang Hyeon-nam",
      "Jeon Jae-joon",
      "Ha Do-yeong",
      "Lee Sa-ra",
      "Choi Hye-jeong",
      "Son Myeon-go"
    ],
    "url": "https://www.themoviedb.org/tv/136283"
  },
  {
    "title": "The Amazing World of Gumball",
    "overview": "The life of Gumball Watterson, a 12-year old cat who attends middle school in Elmore. Accompanied by his pet, adoptive brother, and best friend Darwin Watterson, he frequently finds himself involved in various shenanigans around the city, during which he interacts with various family members: Anais, Richard, and Nicole Watterson, and other various citizens.",
    "cast": [
      "Richard Watterson",
      "Nicole Watterson",
      "Anais Watterson",
      "Granny Jojo",
      "Larry Needlemeyer",
      "Carrie Krueger",
      "Mr. Robinson / Tina Rex",
      "Gumball Watterson",
      "Darwin Watterson"
    ],
    "url": "https://www.themoviedb.org/tv/37606-the-amazing-world-of-gumball"
  },
  {
    "title": "Black Clover",
    "overview": "Asta and Yuno are two orphans who want the same thing: to become the Wizard King. Locked in a friendly rivalry, they work hard towards their goal. While Yuno excels at magic, Asta has a problem uncommon in this world: he has no powers! But, on the day they receive their grimoires, they surprise everyone. To reach their goal, they’ll each find their own path to greatness—with or without magic.",
    "cast": [
      "Asta",
      "Yuno",
      "Noelle Silva",
      "Yami Sukehiro",
      "Magna Swing",
      "Luck Voltia",
      "Finral Roulacase",
      "Gauche Adlai",
      "Charmy Papittoson"
    ],
    "url": "https://www.themoviedb.org/tv/73223"
  },
  {
    "title": "Robotech",
    "overview": "Robotech is an 85-episode adaptation of three different anime television series made between 1982-1984 in Japan; the adaptation was aired in 1985. Within the combined and edited story, Robotechnology refers to the scientific advances discovered in an alien starship that crashed on a South Pacific island. With this technology, Earth developed giant robotic machines or mecha to fight three successive extraterrestrial invasions.",
    "cast": [
      "Max Sterling",
      "Lisa Hayes",
      "Khyron",
      "Henry J. Gloval",
      "Miriya Parina",
      "Rick Hunter",
      "Lynn Minmay",
      "Roy Fokker",
      "Claudia Grant"
    ],
    "url": "https://www.themoviedb.org/tv/2192-robotech"
  },
  {
    "title": "Maid Sama!",
    "overview": "Misaki Ayuzawa is the first female student council president at a once all-boys school turned co-ed. She rules the school with strict discipline demeanor. But she has a secret—she works at a maid cafe due to her families circumstances. One day the popular A-student and notorious heart breaker Takumi Usui finds out her secret and makes a deal with her to keep it hush from the school in exchange for spending some time with him.",
    "cast": [
      "Misaki Ayuzawa",
      "Takumi Usui",
      "Shouichirou Yukimura",
      "Sakura Hanazono",
      "Shizuko Kaga",
      "Tora Igarashi",
      "Chinatsu Aramaki",
      "Suzuna Ayuzawa",
      "Erika"
    ],
    "url": "https://www.themoviedb.org/tv/65648"
  },
  {
    "title": "Generator Rex",
    "overview": "Generator Rex, an average teenager with the ability to turn his body into amazing machines, helps the secret organization Providence save the world from the nanite threat and dangerous EVO monsters.",
    "cast": [
      "Rex Salazar",
      "Noah",
      "Federico"
    ],
    "url": "https://www.themoviedb.org/tv/32118-generator-rex"
  },
  {
    "title": "Blue Spring Ride",
    "overview": "At the end of her first year of high school, Futaba Yoshioka suddenly has a chance encounter with her first love, Kou Tanaka. Three years ago, he transferred schools before she was able to say how she felt about him. After meeting each other again, Futaba realizes that he has gone through many changes. He acts more cool and even had his last name changed to Mabuchi. Gradually the two rekindle their love while piecing together what had happened in the time that they were apart.",
    "cast": [
      "Futaba Yoshioka",
      "Kou Mabuchi",
      "Yuuri Makita",
      "Aya Kominato",
      "Shuuko Murao",
      "Youichi Tanaka"
    ],
    "url": "https://www.themoviedb.org/tv/62602"
  },
  {
    "title": "Mob Psycho 100",
    "overview": "Shigeo Kageyama, a.k.a. \"Mob,\" is a boy who has trouble expressing himself, but who happens to be a powerful esper. Mob is determined to live a normal life and keeps his ESP suppressed, but when his emotions surge to a level of 100%, something terrible happens to him! As he's surrounded by false espers, evil spirits, and mysterious organizations, what will Mob think? What choices will he make?",
    "cast": [
      "Shigeo 'Mob' Kageyama",
      "Arataka Reigen",
      "Ritsu Kageyama",
      "Dimple",
      "Teruki 'Teru' Hanazawa",
      "Sakurai, Tenga Onigawara"
    ],
    "url": "https://www.themoviedb.org/tv/67075-100"
  },
  {
    "title": "The Misfit of Demon King Academy",
    "overview": "Anos Voldigord was a tyrannical Demon King that eradicated humans, spirits, and even the gods, but became bored of eternal warfare and reincarnated with dreams of a peaceful world. However, what awaited him in reincarnation after 2000 years were descendants who became too weak after being accustomed to peace, and all sorts of magic that deteriorated to the extreme. Anos enters Demon King Academy that gathers and educates those who are viewed as the reincarnation of the Demon King, but the academy could not see through his true powers and ends up branding him as a misfit.",
    "cast": [
      "Misa Ilioroagu",
      "Sasha Necron",
      "Misha Necron",
      "Lay Glanzudlii",
      "Eleonore Bianca",
      "Anos Voldigoad",
      "Shin Reglia",
      "Zeshia Bianca",
      "Erdomaid Dittijohn"
    ],
    "url": "https://www.themoviedb.org/tv/97617"
  },
  {
    "title": "Teen Wolf",
    "overview": "Scott McCall, a high school student living in the town of Beacon Hills has his life drastically changed when he's bitten by a werewolf, becoming one himself. He must henceforth learn to balance his problematic new identity with his day-to-day teenage life. The following characters are instrumental to his struggle: Stiles, his best friend; Allison, his love interest who comes from a family of werewolf hunters; and Derek, a mysterious werewolf with a dark past. Throughout the series, he strives to keep his loved ones safe while maintaining normal relationships with them.",
    "cast": [
      "Scott McCall",
      "Stiles Stilinski",
      "Lydia Martin",
      "Noah Stilinski",
      "Malia Tate",
      "Chris Argent",
      "Melissa McCall",
      "Derek Hale",
      "Allison Argent"
    ],
    "url": "https://www.themoviedb.org/tv/34524-teen-wolf"
  },
  {
    "title": "Monster",
    "overview": "Kenzou Tenma, a Japanese brain surgeon in Germany, finds his life in utter turmoil after getting involved with a psychopath that was once a former patient.",
    "cast": [
      "Tenma",
      "Herbert",
      "Nina",
      "Johan",
      "Inspector Lunge",
      "Dr. Reichwein",
      "Dieter"
    ],
    "url": "https://www.themoviedb.org/tv/30981-monster"
  },
  {
    "title": "TONIKAWA: Over the Moon for You",
    "overview": "Nasa Yuzaki falls in love at first sight after an encounter with the mysterious Tsukasa. When Nasa earnestly confesses his feelings, she replies, \"I'll date you, but only if we're married.\" Nasa and Tsukasa's cute and precious newlywed life of love is about to begin!",
    "cast": [
      "Tsukasa Yuzaki",
      "Nasa Yuzaki",
      "Kaname Arisugawa",
      "Aya Arisugawa",
      "Chitose Kaginoji",
      "Charlotte",
      "Aurora",
      "Ginga Onimaru",
      "Ouka Nakiri"
    ],
    "url": "https://www.themoviedb.org/tv/100049"
  },
  {
    "title": "Les Contes de la rue Broca",
    "overview": "We don't have an overview translated in English. Help us expand our database by adding one.",
    "cast": [
      "Mr. Pierre",
      "Nadia",
      "Bachir",
      "Saïd"
    ],
    "url": "https://www.themoviedb.org/tv/73488-les-contes-de-la-rue-broca"
  },
  {
    "title": "Vinland Saga",
    "overview": "For a thousand years, the Vikings have made quite a name and reputation for themselves as the strongest families with a thirst for violence. Thorfinn, the son of one of the Vikings' greatest warriors, spends his boyhood in a battlefield enhancing his skills in his adventure to redeem his most-desired revenge after his father was murdered.",
    "cast": [
      "Thorfinn",
      "Atli",
      "Canute",
      "Torgrim",
      "Gunnar",
      "Magni",
      "Askeladd"
    ],
    "url": "https://www.themoviedb.org/tv/88803"
  },
  {
    "title": "My Love Story!!",
    "overview": "Takeo Goda is a giant guy with a giant heart. Too bad the girls don't want him! (They always go for his good-looking best friend, Makoto Sunakawa.) Used to being on the sidelines, Takeo simply stands tall and accepts his fate. But one day when he saves a girl named Rinko Yamato from a harasser on the train, his (love!) life suddenly takes an incredible turn! Takeo can hardly believe it when he crosses paths with Rinko again, and he finds himself falling in love with her... But with handsome Suna around, does Takeo even stand a chance?",
    "cast": [
      "Takeo Goda",
      "Rinko Yamato",
      "Makoto 'Suna' Sunakawa",
      "Osamu Kurihara",
      "Yuriko Goda",
      "Nanako Yamazaki",
      "Ai Sunakawa",
      "Young Takeo Goda",
      "Ayu"
    ],
    "url": "https://www.themoviedb.org/tv/62565"
  },
  {
    "title": "Adventure Time",
    "overview": "Unlikely heroes Finn and Jake are buddies who traverse the mystical Land of Ooo. The best of friends, our heroes always find themselves in the middle of escapades. Finn and Jake depend on each other through thick and thin.",
    "cast": [
      "Finn the Human",
      "Jake the Dog",
      "Ice King",
      "Princess Bubblegum",
      "Marceline the Vampire Queen",
      "Lumpy Space Princess",
      "Tree Trunks"
    ],
    "url": "https://www.themoviedb.org/tv/15260-adventure-time"
  },
  {
    "title": "Kenichi: The Mightiest Disciple",
    "overview": "Yeah, Kenichi’s a total wimp. He’s always getting picked on and doesn’t have a lot of friends to stick up for him. The guy needs motivation if he hopes to graduate in one piece. Well, Miu’s the perfect motivation. She’s hot, she accepts him, and she just so happens to live at a dojo with six martial arts masters. You could say fate has led Kenichi to their door, or you could say he was just following the hottie. Either way, he’s about to get whipped into serious shape. If he can survive some hard-core training, he might survive another day at school. He might even score with Miu. Yeah, you could call Kenichi a wimp. But let’s go with underdog instead.",
    "cast": [
      "Kenichi Shirahama",
      "Miu Furinji",
      "Akisame Koetsuji",
      "Shio Sakaki",
      "Hayato Furinji",
      "Shigure Kosaka",
      "Apachai Hopachai",
      "Kensei Ma",
      "Haruo Niijima"
    ],
    "url": "https://www.themoviedb.org/tv/37585"
  },
  {
    "title": "Ned's Declassified School Survival Guide",
    "overview": "The whacky adventures of Ned Bigby and his best pals Moze and Cookie at James K. Polk Middle School, as \"every-kid\" Ned shatters the fourth wall to share tips and tricks on navigating middle school or junior high hurdles. Ned's not super cool, and he has no superpowers. He is, however, witty, well-groomed, upbeat and self-aware. Moreover, with more than a little help from his two best friends, he's equipped to conquer middle school minefields. From crushing bullies to crushes, from off- the-wall, mean and cool teachers to pop quizzes, elections and detentions, Ned knows that nothing, including the seventh grade, is as bad as it seems, and friendship matters most.",
    "cast": [
      "Ned Bigby",
      "Jennifer 'Moze' Mosely",
      "Simon 'Cookie' Nelson-Cook",
      "Gordy, Gordy / Cosmo",
      "Billy 'Bully' Loomer",
      "Suzie Crabgrass",
      "Jerry Crony",
      "Lisa Zemo",
      "Coconut Head"
    ],
    "url": "https://www.themoviedb.org/tv/1600-ned-s-declassified-school-survival-guide"
  },
  {
    "title": "Solo Leveling",
    "overview": "They say whatever doesn’t kill you makes you stronger, but that’s not the case for the world’s weakest hunter Sung Jinwoo. After being brutally slaughtered by monsters in a high-ranking dungeon, Jinwoo came back with the System, a program only he could see, that’s leveling him up in every way. Now, he’s inspired to discover the secrets behind his powers and the dungeon that spawned them.",
    "cast": [
      "Shun Mizushino",
      "Kenta Morobishi",
      "Aoi Mizushino",
      "Shizuku Kousaka",
      "Shin Mogami",
      "Taiga Shirakawa",
      "Kiyoomi Goto",
      "Akira Inukai"
    ],
    "url": "https://www.themoviedb.org/tv/127532"
  },
  {
    "title": "Noblesse",
    "overview": "Rai wakes up from 820-years long sleep and starts his new life as a student in a high school founded by his loyal servant, Frankenstein. But his peaceful days with other human students are soon interrupted by mysterious attackers known as the \"Unions\".",
    "cast": [
      "Regis K. Landegre",
      "Hammer",
      "Rael Kertia",
      "Kase Manabu",
      "Tashiro Yusuke",
      "M-21",
      "Tao",
      "Takeo",
      "Seira J. Loyard"
    ],
    "url": "https://www.themoviedb.org/tv/99779-noblesse"
  },
  {
    "title": "She-Ra and the Princesses of Power",
    "overview": "In this reboot of the '80s series, a magic sword transforms an orphan girl into warrior She-Ra, who unites a rebellion to fight against evil.",
    "cast": [
      "Adora / She-Ra",
      "Glimmer",
      "Catra",
      "Bow",
      "Angella",
      "Shadow Weaver",
      "Hordak",
      "Scorpia",
      "Entrapta"
    ],
    "url": "https://www.themoviedb.org/tv/79732-she-ra-and-the-princesses-of-power"
  },
  {
    "title": "The Helpful Fox Senko-san",
    "overview": "Like many hardworking members of the workforce, Kuroto Nakano is perpetually stressed out by his job. Still, since he lives alone, he must carry on to sustain himself. Little do humans like Kuroto know, this stress takes the form of darkness residing within a person's body and will bring one's life to ruin.",
    "cast": [
      "Senko",
      "Kuroto Nakano",
      "Yasuko Kouenji",
      "Shiro",
      "Yozora",
      "Little Yoko"
    ],
    "url": "https://www.themoviedb.org/tv/87461"
  },
  {
    "title": "Why the Hell Are You Here, Teacher!?",
    "overview": "Ichiro Sato is about as average as a student can get... except for his above-average ability to land himself in totally awkward, intensely risqué situations with his no-nonsense teacher, Kana Kojima! Ichiro has his hands full dealing with these steamy shenanigans and unexpected encounters in the most unlikely places. At least it can’t get any worse, right?",
    "cast": [
      "Kana Kojima",
      "Takashi Takahashi",
      "Mayu Matsukaze",
      "Ichirō Satō",
      "Hikari Hazakura",
      "Chizuru Tachibana",
      "Kō Tanaka",
      "Rin Suzuki",
      "Saya Matsukaze"
    ],
    "url": "https://www.themoviedb.org/tv/86836"
  },
  {
    "title": "W: Two Worlds Apart",
    "overview": "After being pulled into the webtoon world created by her father, a surgical resident gets entangled in a murder mystery involving the story's hero.",
    "cast": [
      "Kang Cheol",
      "Oh Yeon-joo",
      "Yoon So-hee",
      "Seo Do-yoon",
      "Park Soo-bong",
      "Han Cheol-ho",
      "Oh Sung-moo",
      "Kang Seok-beom",
      "Park Min-soo"
    ],
    "url": "https://www.themoviedb.org/tv/66330"
  },
  {
    "title": "Berserk",
    "overview": "Guts, a man who calls himself \"The Black Swordsman\", looks back upon his days serving as a member of a group of mercenaries. Led by an ambitious, ruthless, and intelligent man named Griffith, together they battle their way into the royal court, and are forced into a fate that changes their lives.",
    "cast": [
      "Guts",
      "Griffith",
      "Caska",
      "Corkus",
      "Narrator",
      "Judeau",
      "Rickert"
    ],
    "url": "https://www.themoviedb.org/tv/35935"
  }
]